employ_dict={
    "王力宏":{
        "部门":"科技部",
        "工资":3000,
        "级别":1
    },
    "周杰伦":{
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    },
    "林俊杰":{
        "部门":"市场部",
        "工资":7000,
        "级别":3
    },
    "张学友":{
        "部门":"科技部",
        "工资":4000,
        "级别":1
    },
    "刘德华":{
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    }
}
print(f"员工在升职加薪之前的结果:{employ_dict}")
for key1 in employ_dict:
    if(employ_dict[key1]["级别"]==1):
        employ_dict[key1]["级别"]+=1
        employ_dict[key1]["工资"]+=1000

print(f"员工在升职加薪之后的结果:{employ_dict}")